/*
任务三
2017-1-13 19:00:59
    写一个流水灯 
    从左向右流，再从右向左流
    在从两边向中间流 *3
*/
#include<reg52.h>
void delay(int a){
	char i;
	int j;
	for(j=0;j<a;j++)
		for(i=0;i<125;i++)
			;
}
void main(){
/*	从右向左				 1000 0000
        0111 1111 >> 1 : 0011 1111
        1011 1111
		1101 1111
		... 
		从左向右
		1111 1110 << 1 : 1111 1100
		1111 1101
		1111 1011
		...
		0111 1110 	 7e
		1011 1101	 bd
		1101 1011	 db
		1110 0111	 e7
	*/
	char i;
	int led;
	while(1){
		led = 0xfe; 
		for(i=0;i<8;i++){
	   		P0 = led;
			led = (led << 1)+1;
	    	delay(1000);
		}
		// 从右向左
		led = 0x7f;
	   	for(i=0;i<8;i++){
	   		P0 = led;
			led = (led >> 1)+0x80;
	    	delay(1000);
		}
	
	}

}